{
  "tone": "casual",
  "recipient": "friend",
  "context": "I neglected our friendship when I started a new relationship",
  "letters": [
    "Hey [Friend's Name],\n\nI hope you’re doing well. I’ve been meaning to reach out and talk about something that’s been on my mind lately. I want to sincerely apologize for kind of dropping the ball on our friendship when I got wrapped up in my new relationship. \n\nI know I haven’t been as present, and it’s not fair to you. You’ve always been an important part of my life, and I realize now that I let myself get a little carried away with the newness of things. I should have made more of an effort to stay connected, and I’m really sorry for not doing that.\n\nI value our friendship so much, and I don’t want you to feel like you were pushed aside. Let’s catch up soon—I’d love to hear what you’ve been up to and make sure we’re back on track. Plus, I could really use some friend time!\n\nThanks for understanding, and I hope you can forgive my oversight. \n\nTalk soon!\n\n[Your Name]",
    "Dear [Friend's Name],\n\nI hope this message finds you well. I’ve been reflecting on my recent behavior, and I feel it’s important to reach out and express how truly sorry I am for neglecting our friendship. \n\nWhen I started my new relationship, I got caught up in the excitement and newness that comes with it. Unfortunately, I didn’t realize how much I was pulling away from you and the bond we’ve built over the years. You have always been an important part of my life, and I regret that my actions made you feel less valued or overlooked.\n\nPlease know that it was never my intention to hurt you or to make you feel any less important to me. I’ve realized that friendships require effort and attention, just like any other important relationship, and I neglected that during this transition in my life.\n\nI genuinely miss our conversations and the moments we used to share. I want to make amends and show you how much your friendship means to me. If you’re willing, I’d love to catch up and hear how you’ve been. \n\nThank you for being such a wonderful friend, and I truly hope you can forgive me for my thoughtlessness.\n\nWith heartfelt apologies,\n\n[Your Name]"
  ]
}