{
  "tone": "sincere",
  "recipient": "friend",
  "context": "I was unsupportive during your time of need",
  "letters": [
    "I hope this message finds you well. I've been reflecting on our recent conversations, and I want to take a moment to apologize sincerely for my lack of support during your time of need. \n\nI realize that I wasn’t there for you when you really needed a friend, and I deeply regret that my actions—or lack thereof—didn’t convey how much I care about you. You deserved someone to lean on, and I failed to be that person. \n\nI want you to know that I am truly sorry for not being more attentive and present. Your feelings and experiences matter to me, and it pains me to think that I may have added to your burden instead of helping to lighten it. \n\nPlease know that I am here for you now. I value our friendship deeply, and I hope to earn back your trust. I am committed to being a better friend moving forward, and I am ready to listen and support you in any way you need.\n\nThank you for your understanding, and I hope we can talk soon. \n\nWith all my heartfelt apologies,  \n[Your Name]",
    "Dear [Friend's Name],\n\nI hope this message finds you well. I am writing to express my sincerest apologies for my lack of support during a time when you needed it most. I recognize that I failed to be there for you in a meaningful way, and for that, I am truly sorry.\n\nReflecting on our recent interactions, I realize how important it is for friends to stand by one another, especially during challenging times. You were facing difficult circumstances, and my inability to provide the support you deserved was deeply disappointing. I regret not being more attentive and present, and I understand how my actions, or lack thereof, may have affected you.\n\nPlease know that it was never my intention to undermine your feelings or experience. I value our friendship immensely and am committed to doing better in the future. Your feelings matter to me, and I want to ensure that you always feel supported and understood.\n\nI hope you can find it in your heart to forgive me, and I welcome the opportunity to make amends and be a better friend moving forward. If you are open to it, I would love to discuss how I can support you in the future.\n\nThank you for considering my apology. I look forward to rebuilding your trust in me.\n\nWarm regards,\n\n[Your Name]"
  ]
}