{
  "tone": "apologetic",
  "recipient": "mother",
  "context": "I failed to appreciate your sacrifices",
  "letters": [
    "Dear Mom,\n\nI hope this note finds you well. I’ve been reflecting on my actions and the words I’ve spoken lately, and I feel compelled to reach out and express my sincerest apologies.\n\nI realize that I have failed to fully appreciate the countless sacrifices you have made for me over the years. Your unwavering support and selflessness have shaped my life in ways I often take for granted. I understand now that these sacrifices came from a place of love, and I am truly sorry for not acknowledging them as I should have.\n\nI regret any hurt my lack of appreciation may have caused you. You have always put my needs before your own, and I didn’t recognize the depth of your commitment until now. Thank you for being my greatest advocate and for the countless ways you’ve nurtured and guided me. I want you to know that I am listening and learning, and I promise to be more aware of the love and effort you pour into our family.\n\nPlease forgive me for my insensitivity. I am deeply grateful to have you as my mother, and I hope to show you that gratitude more consistently moving forward. \n\nWith all my love,\n\n[Your Name]",
    "Dear Mom,\n\nI hope this letter finds you well. I’ve been reflecting on my actions and the moments we’ve shared, and I feel compelled to reach out and express my heartfelt regrets.\n\nI realize now that I have often taken your sacrifices for granted. Your unwavering support and the countless things you’ve done for our family deserve so much more recognition than I have given them. I’m truly sorry for the times when I didn’t appreciate everything you’ve done and the love you've poured into our lives.\n\nYour selflessness has shaped me in ways I am just beginning to understand. The late nights, the early mornings, the constant balancing act you undertook for us — I failed to acknowledge how monumental those efforts were and how much they meant to me. For that, I am deeply sorry.\n\nI hope to do better moving forward, to show you the appreciation you truly deserve. Thank you for being my unwavering support, even when I didn’t show it. I love you more than words can express.\n\nWith all my love,\n\n[Your Name]"
  ]
}